CREATE DATABASE LAB22SQL;
USE LAB22SQL
CREATE TABLE [dbo].[Валюта](
  [Код_Валюты] [int] NOT NULL PRIMARY KEY,
  [Название] [nvarchar](50) NOT NULL,
  [Обозначение] [nvarchar](50) NOT NULL
  );

GO


CREATE TABLE [dbo].[Аналитическая ведомость](
  [Код_Валюты] [int] NOT NULL,
  [Количество] [float] NULL
) ON [PRIMARY]

GO

ALTER TABLE [dbo].[Аналитическая ведомость]  WITH CHECK ADD  CONSTRAINT [FK_Аналитическая ведомость_Валюта] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Валюта] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Аналитическая ведомость] CHECK CONSTRAINT [FK_Аналитическая ведомость_Валюта]
GO

ALTER TABLE [dbo].[Аналитическая ведомость]  WITH CHECK ADD  CONSTRAINT [FK_Аналитическая ведомость_Справочник курсов валют] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Справочник курсов валют] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Аналитическая ведомость] CHECK CONSTRAINT [FK_Аналитическая ведомость_Справочник курсов валют]
GO
CREATE TABLE [dbo].[Операция](
  [Код_Валюты] [int] NOT NULL,
  [Количество] [float] NOT NULL,
  [Назначение] [nvarchar](50) NULL,
  [Дата] [date] NOT NULL
) ON [PRIMARY]

GO

ALTER TABLE [dbo].[Операция]  WITH CHECK ADD  CONSTRAINT [FK_Операция_Валюта] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Валюта] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Операция] CHECK CONSTRAINT [FK_Операция_Валюта]
GO

CREATE TABLE [dbo].[Отчет по курсовой разнице](
  [Код_Валюты] [int] NOT NULL,
  [Дата] [date] NOT NULL,
  [Приход/Расход] [float] NULL
) ON [PRIMARY]

GO

ALTER TABLE [dbo].[Отчет по курсовой разнице]  WITH CHECK ADD  CONSTRAINT [FK_Отчет по курсовой разнице_Валюта] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Валюта] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Отчет по курсовой разнице] CHECK CONSTRAINT [FK_Отчет по курсовой разнице_Валюта]
GO

ALTER TABLE [dbo].[Отчет по курсовой разнице]  WITH CHECK ADD  CONSTRAINT [FK_Отчет по курсовой разнице_Справочник курсов валют] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Справочник курсов валют] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Отчет по курсовой разнице] CHECK CONSTRAINT [FK_Отчет по курсовой разнице_Справочник курсов валют]
GO

CREATE TABLE [dbo].[Справочник курсов валют](
  [Код_Валюты] [int] NOT NULL PRIMARY KEY,
  [Дата] [date] NOT NULL,
  [Курс] [money] NOT NULL,
 );

GO

ALTER TABLE [dbo].[Справочник курсов валют]  WITH CHECK ADD  CONSTRAINT [FK_Справочник курсов валют_Валюта] FOREIGN KEY([Код_Валюты])
REFERENCES [dbo].[Валюта] ([Код_Валюты])
GO

ALTER TABLE [dbo].[Справочник курсов валют] CHECK CONSTRAINT [FK_Справочник курсов валют_Валюта]
GO

INSERT INTO Валюта (Код_валюты, Название, Обозначение)
VALUES 
  ('001', 'Доллар США', 'USD'),
  ('002', 'Евро', 'EUR'),
  ('003', 'Фунт стерлингов', 'GBP'),
  ('004', 'Японская иена', 'JPY'),
  ('005', 'Австралийский доллар', 'AUD'),
  ('006', 'Канадский доллар', 'CAD'),
  ('007', 'Швейцарский франк', 'CHF'),
  ('008', 'Китайский юань', 'CNY'),
  ('009', 'Гонконгский доллар', 'HKD'),
  ('010', 'Индийская рупия', 'INR'),
  ('011', 'Южнокорейская вона', 'KRW'),
  ('012', 'Мексиканское песо', 'MXN'),
  ('013', 'Малайзийский ринггит', 'MYR'),
  ('014', 'Норвежская крона', 'NOK'),
  ('015', 'Новозеландский доллар', 'NZD'),
  ('016', 'Российский рубль', 'RUB'),
  ('017', 'Шведская крона', 'SEK'),
  ('018', 'Сингапурский доллар', 'SGD'),
  ('019', 'Тайский бат', 'THB'),
  ('020', 'Турецкая лира', 'TRY'),
  ('021', 'Южноафриканский рэнд', 'ZAR'),
  ('022', 'Бразильский реал', 'BRL'),
  ('023', 'Аргентинское песо', 'ARS'),
  ('024', 'Чилийское песо', 'CLP'),
  ('025', 'Колумбийское песо', 'COP'),
  ('026', 'Египетский фунт', 'EGP'),
  ('027', 'Индонезийская рупия', 'IDR'),
  ('028', 'Израильский шекель', 'ILS'),
  ('029', 'Иранский риал', 'IRR'),
  ('030', 'Иракский динар', 'IQD'),
  ('031', 'Иорданский динар', 'JOD');



-- заполнение таблицы данными на 11 апреля 2023 года
INSERT INTO [Справочник курсов валют] (Код_Валюты, Дата, Курс)
VALUES 
  ('001', '2023-04-11', 2.4515),
  ('002', '2023-04-11', 2.7555),
  ('003', '2023-04-11', 0.0342),
  ('004', '2023-04-11', 3.2113),
  ('005', '2023-04-11', 0.0223),
  ('006', '2023-04-11', 1.9009),
  ('007', '2023-04-11', 2.5811),
  ('008', '2023-04-11', 1.7928),
  ('009', '2023-04-11', 0.0921),
  ('010', '2023-04-11', 0.3805),
  ('011', '2023-04-11', 0.3147),
  ('012', '2023-04-11', 1),
  ('013', '2023-04-11', 0.0448),
  ('014', '2023-04-11', 0.0285),
  ('015', '2023-04-11', 0.0324),
  ('016', '2023-04-11', 0.0355),
  ('017', '2023-04-11', 0.2175),
  ('018', '2023-04-11', 0.0007),
  ('019', '2023-04-11', 0.0055),
  ('020', '2023-04-11', 0.0793),
  ('021', '2023-04-11', 0.0361),
  ('022', '2023-04-11', 0.0278),
  ('023', '2023-04-11', 0.1792),
  ('024', '2023-04-11', 0.0039),
  ('025', '2023-04-11', 0.0046),
  ('026', '2023-04-11', 0.0042),
  ('027', '2023-04-11', 0.0046),
  ('028', '2023-04-11', 0.004),
  ('029', '2023-04-11', 0.0003),
  ('030', '2023-04-11', 0.001),
  ('031', '2023-04-11', 0.0005)
;

-- заполнение таблицы случайными данными
INSERT INTO [Аналитическая ведомость] (Код_Валюты, Количество)
VALUES 
  ('001', 205),
  ('002', 498),
  ('003', 97),
  ('004', 301),
  ('005', 714),
  ('006', 923),
  ('007', 143),
  ('008', 420),
  ('009', 253),
  ('010', 1103),
  ('011', 834),
  ('012', 613),
  ('013', 447),
  ('014', 569),
  ('015', 869),
  ('016', 1229),
  ('017', 967),
  ('018', 357),
  ('019', 769),
  ('020', 676),
  ('021', 1517),
  ('022', 739),
  ('023', 220),
  ('024', 301),
  ('025', 409),
  ('026', 53),
  ('027', 625),
  ('028', 247),
  ('029', 103),
  ('030', 152),
  ('031', 77);

  INSERT INTO [Отчет по курсовой разнице] (Код_Валюты, Дата, [Приход/Расход])
VALUES
    ('001', '2021-02-10', -879120),
    ('002', '2023-01-08', 680070),
    ('003', '2022-10-21', 938979),
    ('004', '2021-11-01', -190491),
    ('005', '2022-03-02', -200512),
    ('006', '2022-02-17', 919447),
    ('007', '2022-05-18', -142405),
    ('008', '2022-05-22', -273003),
    ('009', '2023-01-22', 509799),
    ('010', '2021-12-05', -441734),
    ('011', '2021-05-26', -157438),
    ('012', '2023-03-08', 272520),
    ('013', '2022-12-01', 342537),
    ('014', '2022-01-17', -611565),
    ('015', '2021-11-10', 219283),
    ('016', '2021-06-21', -116677),
    ('017', '2022-04-05', -748714),
    ('018', '2023-02-14', -360871),
    ('019', '2021-08-30', -378341),
    ('020', '2022-08-03', 583090),
    ('021', '2022-02-04', -71034),
    ('022', '2021-12-30', -925023),
    ('023', '2023-03-14', 502011),
    ('024', '2022-03-09', 820399),
    ('025', '2022-06-12', -872516),
    ('026', '2021-07-09', -604206),
    ('027', '2023-02-24', 327899),
    ('028', '2022-01-12', -720747),
    ('029', '2022-05-26', 334043),
    ('030', '2021-09-19', 289400),
    ('031', '2022-11-08', -777768);

	INSERT INTO Операция (Код_валюты, Количество, Назначение, Дата) VALUES
('001', 345, 'Покупка мебели', '2021-06-05'),
('010', 987, 'Оплата за рекламу', '2021-07-12'),
('021', 600, 'Закупка материалов', '2021-07-19'),
('013', -275, 'Аренда помещения', '2021-08-02'),
('029', 789, 'Закупка оборудования', '2021-08-16'),
('002', -532, 'Оплата за грузоперевозку', '2021-08-26'),
('020', 375, 'Покупка офисной техники', '2021-09-05'),
('008', -150, 'Оплата за интернет-услуги', '2021-09-10'),
('011', 275, 'Покупка расходных материалов', '2021-09-15'),
('004', -750, 'Компенсация сотруднику', '2021-10-02'),
('025', 100, 'Покупка канцелярских товаров', '2021-10-05'),
('009', -2000, 'Погашение кредита', '2021-10-12'),
('018', 450, 'Покупка программного обеспечения', '2021-11-01'),
('005', -125, 'Оплата за услуги бухгалтера', '2021-11-09'),
('012', 325, 'Покупка офисной мебели', '2021-11-15'),
('023', -800, 'Командировочные расходы', '2021-11-20'),
('030', 275, 'Оплата за подписку на журналы', '2021-12-01'),
('022', -650, 'Погашение задолженности по налогам', '2021-12-10'),
('015', 875, 'Покупка рекламных материалов', '2021-12-15'),
('006', -400, 'Оплата за услуги юриста', '2022-01-02'),
('026', 625, 'Закупка офисной техники', '2022-01-07'),
('016', -950, 'Погашение задолженности по поставщикам', '2022-01-15'),
('028', 550, 'Покупка оборудования', '2022-02-01'),
('017', -375, 'Оплата за услуги системного администратора', '2022-02-09'),
('013', 8472, 'Зарплата сотрудникам', '2021-10-23'),
('015', -3925.5, 'Оплата поставщиков', '2022-02-11'),
('017', 12345.67, 'Поступление средств от инвестора', '2022-06-30'),
('019', -987.654, 'Оплата коммунальных услуг', '2022-08-15'),
('020', 100000, 'Зачисление денежных средств от клиента', '2022-10-02'),
('025', -7896.54, 'Оплата кредита', '2023-01-05'),
('027', 25000, 'Покупка оборудования', '2023-02-20'),
('028', -3400.25, 'Оплата за рекламу', '2023-03-11'),
('029', 1234.56, 'Пополнение банковского счета', '2023-04-02'),
('031', -56789, 'Оплата поставщиков', '2023-04-30'),
('010', 10000, 'Покупка товара у поставщика', '2021-07-12'),
('012', -456.78, 'Оплата услуг связи', '2021-08-23'),
('014', 2345.67, 'Поступление средств от клиента', '2021-09-05'),
('016', -9876.54, 'Оплата поставщиков', '2021-11-15'),
('018', 5000, 'Покупка компьютерного оборудования', '2022-03-02'),
('021', -789.12, 'Оплата налогов', '2022-11-11'),
('022', 12000, 'Получение кредита', '2022-12-05'),
('023', -6543.21, 'Оплата аренды офиса', '2023-01-01'),
('024', 15000, 'Покупка автомобиля', '2023-01-20'),
('026', -100000, 'Перевод на другой счет', '2023-02-10'),
('030', 3456.78, 'Получение средств от партнера', '2023-04-15'),
('011', -2345.67, 'Оплата услуг по техническому обслуживанию', '2021-08-30'),
('013', 8472, 'Получение выручки от продажи', '2021-10-31'),
('015', -3925.5, 'Оплата за проезд на транспорте', '2022-01-25'),
('001', 300, 'Заработная плата', '2022-07-03'),
('002', -500, 'Покупка продуктов', '2022-07-03'),
('003', 1000, 'Продажа акций', '2022-07-03'),
('004', -250, 'Оплата услуг связи', '2022-07-03'),
('005', 750, 'Заработная плата', '2022-07-03'),
('006', -100, 'Покупка подарка', '2022-07-03'),
('007', 150, 'Возврат долга', '2022-07-03'),
('008', -2000, 'Оплата кредита', '2022-07-03'),
('009', 550, 'Заработная плата', '2022-07-03'),
('010', -150, 'Покупка билетов', '2022-07-03'),
('011', 800, 'Продажа книг', '2022-07-03'),
('012', -75, 'Оплата интернета', '2022-07-03'),
('013', 400, 'Заработная плата', '2022-07-03'),
('014', -2500, 'Покупка недвижимости', '2022-07-03'),
('015', 1200, 'Продажа автомобиля', '2022-07-03'),
('016', -300, 'Оплата коммунальных услуг', '2022-07-03'),
('017', 900, 'Заработная плата', '2022-07-03'),
('018', -50, 'Покупка мелочей', '2022-07-03'),
('019', 2000, 'Продажа драгоценностей', '2022-07-03'),
('020', -5000, 'Оплата крупной покупки', '2022-07-03'),
('021', 250, 'Заработная плата', '2022-07-03'),
('022', -75, 'Покупка билетов на концерт', '2022-07-03'),
('023', 100, 'Продажа старых вещей', '2022-07-03'),
('024', -150, 'Оплата за ремонт', '2022-07-03'),
('025', 700, 'Заработная плата', '2022-07-03'),
('026', -250, 'Покупка одежды', '2022-07-03');

SELECT [Аналитическая ведомость].Код_Валюты, Валюта.Обозначение, [Аналитическая ведомость].Количество
FROM [Аналитическая ведомость] 
INNER JOIN Валюта
ON [Аналитическая ведомость].Код_Валюты = Валюта.Код_Валюты
WHERE [Аналитическая ведомость].Количество>200


SELECT DISTINCT [Аналитическая ведомость].Код_Валюты, SUM(Количество) AS [Итого валюты]
FROM [Аналитическая ведомость]
GROUP BY Код_Валюты
HAVING SUM(Количество) > 300;

INSERT INTO Операция (Код_Валюты, Количество, Назначение, Дата)
VALUES 
	('002', 4932, 'Продажа активов', '2022-12-22');

DELETE FROM Операция
WHERE Код_Валюты = '003';

UPDATE [Справочник курсов валют]
SET Курс = 2.55
WHERE Курс = 2.50

SELECT [Отчет по курсовой разнице].Код_Валюты, [Отчет по курсовой разнице].[Приход/Расход] INTO [Прибыльные валюты]
FROM [Отчет по курсовой разнице]
WHERE [Отчет по курсовой разнице].[Приход/Расход]>=0;

SELECT CAST(Код_Валюты AS NVARCHAR(3)) +' ' + Валюта.Название + ' ' + Валюта.Обозначение AS [Информация о валютах]
  FROM Валюта
  UNION
  SELECT CAST(Код_Валюты AS NVARCHAR(3))
  FROM [Аналитическая ведомость]

  DELETE FROM Операция WHERE Количество < -50000


  CREATE INDEX Валюта_Код_Валюты_Обозначение_индекс
  ON Валюта(Код_Валюты, Обозначение)
  GO


  CREATE VIEW Валюта_в_рублях(Код_Валюты, Курс, Количество) AS 
  SELECT [Аналитическая ведомость].Код_Валюты, [Справочник курсов валют].Курс, [Аналитическая ведомость].Количество*[Справочник курсов валют].Курс
  From [Аналитическая ведомость] INNER JOIN [Справочник курсов валют] ON [Справочник курсов валют].Код_Валюты=[Аналитическая ведомость].Код_Валюты